{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "video_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 109, 150, 1], "dtype": "float32", "sparse": false, "name": "video_input"}, "inbound_nodes": []}, {"name": "fc3d_conv3d_0_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d_0_3d2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["video_input", 0, 0, {}]]]}, {"name": "fc3d_bn_0_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn_0_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu_0_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu_0_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_conv3d2_0_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d2_0_3d2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d_relu_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_bn2_0_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn2_0_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d2_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu2_0_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu2_0_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn2_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_mp_0_3d2", "class_name": "MaxPooling3D", "config": {"name": "fc3d_mp_0_3d2", "trainable": true, "dtype": "float32", "pool_size": [3, 3, 3], "padding": "valid", "strides": [3, 3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["fc3d_relu2_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_conv3d_1_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d_1_3d2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d_mp_0_3d2", 0, 0, {}]]]}, {"name": "fc3d_bn_1_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn_1_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu_1_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu_1_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_conv3d2_1_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d2_1_3d2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d_relu_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_bn2_1_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn2_1_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d2_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu2_1_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu2_1_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn2_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_mp_1_3d2", "class_name": "MaxPooling3D", "config": {"name": "fc3d_mp_1_3d2", "trainable": true, "dtype": "float32", "pool_size": [3, 3, 3], "padding": "valid", "strides": [3, 3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["fc3d_relu2_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_conv3d_2_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d_2_3d2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d_mp_1_3d2", 0, 0, {}]]]}, {"name": "fc3d_bn_2_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn_2_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d_2_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu_2_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu_2_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn_2_3d2", 0, 0, {}]]]}, {"name": "fc3d_conv3d2_2_3d2", "class_name": "Conv3D", "config": {"name": "fc3d_conv3d2_2_3d2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d_relu_2_3d2", 0, 0, {}]]]}, {"name": "fc3d_bn2_2_3d2", "class_name": "BatchNormalization", "config": {"name": "fc3d_bn2_2_3d2", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["fc3d_conv3d2_2_3d2", 0, 0, {}]]]}, {"name": "fc3d_relu2_2_3d2", "class_name": "ReLU", "config": {"name": "fc3d_relu2_2_3d2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fc3d_bn2_2_3d2", 0, 0, {}]]]}, {"name": "fc3d_finalMP", "class_name": "MaxPooling3D", "config": {"name": "fc3d_finalMP", "trainable": true, "dtype": "float32", "pool_size": [3, 3, 3], "padding": "valid", "strides": [3, 3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["fc3d_relu2_2_3d2", 0, 0, {}]]]}, {"name": "video_vector", "class_name": "Flatten", "config": {"name": "video_vector", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["fc3d_finalMP", 0, 0, {}]]]}, {"name": "fc3d2_drop", "class_name": "Dropout", "config": {"name": "fc3d2_drop", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["video_vector", 0, 0, {}]]]}, {"name": "fc3d2_out", "class_name": "Dense", "config": {"name": "fc3d2_out", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc3d2_drop", 0, 0, {}]]]}], "input_layers": [["video_input", 0, 0]], "output_layers": [["fc3d2_out", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}